idle_msg: str = "Введите /start, чтобы начать работу с ботом :)"

hello_msg: str = "Привет, я бот для знакомств среди студентов!"

menu_msg: str = "Меню"

has_no_tg_username_msg: str = "У вас не заполнена короткая личная ссылка в телеграме (никнейм после символа \"@\"), без него другие пользователи не смогут связаться с вами. Чтобы продолжить заполните его и введите /start"

register_msg: str = "Сначала нужно заполнить информацию о себе"

ask_description_msg: str = "Отправь в ответном сообщении, что будет отображаться в описании твоей анкеты. Расскажи о себе, кого ищешь, чего ждёшь от знакомств и т.д."

description_accepted_msg: str = "Описание принято"

description_declined_msg: str = "Описание слишком длинное, максимальная длина - 1024 символа, включая переносы строк и пробелы.\nОтправьте текст короче"

ask_photo_msg: str = "Отправь мне своё фото (не как документ), которое будет отображаться в твоей анкете. Это должна быть твоя настоящая фотография, иначе твой аккаунт будет удалён!"

photo_accepted_msg: str = "Фото принято"

photo_declined_msg: str = "Ошибка загрузки фото, попробуйте ещё раз"

sex_msg: str = "Выберите ваш пол"

sex_male: str = "Мужской"

sex_female: str = "Женский"

preferables_msg: str = "Кого вам предлагать при поиске?"

preferables_male_btn: str = "Парни"

preferables_female_btn: str = "Девушки"

preferables_all_btn: str = "Всех"

register_ended_msg: str = "Анкета заполнена, вперёд в поисках новых знакомств!"

how_it_works_btn: str = "Как это работает?"

how_it_works_msg: str = """Используя Bot, ты сможешь найти себе вторую половинку онлайн! ❤️
Всё работает просто: твоя анкета и фото, которые ты указал при старте бота, показываются другим людям, при этом ты тоже можешь смотреть анкеты других людей, просто нажми "Смотреть людей" в Меню.
В зависимости от интереса, которое побудила у тебя анкета, ты можешь нажать "Нравится" или "Не нравится", после чего показывается следующая анкета. Если кому-то тоже понравилась твоя анкета, бот уведомляет тебя об этом, отправив сообщение с анкетой и telegram-ником этого человека.
Изменить анкету можно в разделе "Моя анкета" в Меню."""

my_profie_btn: str = "Моя анкета"

edit_description_btn: str = "Изменить описание"

edit_photo_btn: str = "Изменить фото"

edit_sex_btn: str = "Изменить пол"

edit_preferables_btn: str = "Изменить предпочтения"

ban_msg: str = "Ваш аккаунт отключен"

see_people_btn: str = "Смотреть людей"

like_btn: str = "Нравится"

dislike_btn: str = "Не нравится"

see_people_next: str = "Смотреть дальше"

see_people_end_msg: str = "На данный момент всё просмотрено!"

match_msg: str = "У вас новое совпадение! Вам обоим отправлены ники друг друга в телеграме, можете смело писать!\nНапомним, кто это был:"

my_matches_btn: str = "Мои совпадения"

my_matches: str = "У вас взаимная симпатия с:"

about_creators_btn: str = "О создателях"

about_creators_msg: str = "@maxim_tep Тепайкин Максим - идея проекта, техническая реализация, администрирование"

to_main_menu_btn: str = "В главное меню"

not_implemented_msg: str = "Ещё не реализовано :("

