from TextsBase import *

hello_msg: str = "Привет, я бот для знакомств среди студентов!"

how_it_works_msg: str = """Используя Bot, ты сможешь найти себе вторую половинку онлайн! ❤️
Всё работает просто: твоя анкета и фото, которые ты указал при старте бота, показываются другим людям, при этом ты тоже можешь смотреть анкеты других людей, просто нажми "Смотреть людей" в Меню.
В зависимости от интереса, которое побудила у тебя анкета, ты можешь нажать "Нравится" или "Не нравится", после чего показывается следующая анкета. Если кому-то тоже понравилась твоя анкета, бот уведомляет тебя об этом, отправив сообщение с анкетой и telegram-ником этого человека.
Изменить анкету можно в разделе "Моя анкета" в Меню."""
